
Функция WhoCallServiceApiProcessingEvent(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ОтветЗапросаНайти = "";
	//
	НомерТелефона = "";
	Если Запрос.ПараметрыЗапроса.Количество() > 0 Тогда
		Для каждого СтрокаТЗ из Запрос.ПараметрыЗапроса Цикл
			Если СтрокаТЗ.Ключ = "t" Тогда
				НомерТелефона = СтрокаТЗ.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//
	Если НомерТелефона = "" Тогда
		Возврат Ответ;
	КонецЕсли;
	ЗапросНайти = Новый Запрос();
	ЗапросНайти.Текст = ТекстЗапросаНайтиПоНомеруТелефона();
	ЗапросНайти.УстановитьПараметр("НомерТелефона", НомерТелефона);
	//
	ТЗ = ЗапросНайти.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);	
	//
	ЗаписьJSON = Новый ЗаписьJSON;
	СтруктураДанныхJson = Новый Структура("name");
	//
	Если ТЗ.Количество()=0 Тогда
		//Предупреждение("Нет данных.");
		ЗаписьJSON.УстановитьСтроку();
		СтруктураДанныхJson.Вставить("name", НомерТелефона);
		ЗаписатьJSON(ЗаписьJSON, СтруктураДанныхJson);
		СтрокаJson = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(""+СтрокаJson);
		Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
		Возврат Ответ;
	КонецЕсли;
	//
	Индекс = 0;
	name = "";
	ЗаписьJSON.УстановитьСтроку();
	Для каждого СтрокаТЗ из ТЗ Цикл
		Если Индекс < 1 Тогда
			name = СтрокаТЗ.Наименование + " <" + СтрокаТЗ.НомерТелефона + ">";
		Иначе
			name = name + ", " + СтрокаТЗ.Наименование + " <" + СтрокаТЗ.НомерТелефона + ">";	
		КонецЕсли;
		Индекс = Индекс + 1;	
	КонецЦикла;
	//СтруктураДанныхJson.Вставить("name", Транслит(name));
	СтруктураДанныхJson.Вставить("name", name);
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанныхJson);
	СтрокаJson = ЗаписьJSON.Закрыть();
	//
	Ответ.УстановитьТелоИзСтроки(""+СтрокаJson);
	Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
	Возврат Ответ;
КонецФункции

Функция ТекстЗапросаНайтиПоНомеруТелефона()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
	|	ПартнерыКонтактнаяИнформация.Ссылка.Наименование КАК Наименование,
	|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	""Партнер"" КАК ТипКонтакта
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.НомерТелефона <> """"
	|	И ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 10
	|	ПользователиКонтактнаяИнформация.Ссылка.Наименование,
	|	ПользователиКонтактнаяИнформация.НомерТелефона,
	|	ПользователиКонтактнаяИнформация.НомерТелефонаБезКодов,
	|	""Пользователь программы""
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.НомерТелефона <> """"
	|	И ПользователиКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 10
	|	КонтрагентыКонтактнаяИнформация.Ссылка.Наименование,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов,
	|	""Контрагент""
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
	|	И КонтрагентыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 10
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка.Наименование,
	|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона,
	|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефонаБезКодов,
	|	""Физическое лицо""
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона <> """"
	|	И ФизическиеЛицаКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""";

КонецФункции

Функция Транслит(Строка) 
    
   Рез = СокрЛП(Строка);   
   Рез = СтрЗаменить(Рез,"а","a"); 
   Рез = СтрЗаменить(Рез,"б","b"); 
   Рез = СтрЗаменить(Рез,"в","v"); 
   Рез = СтрЗаменить(Рез,"г","g"); 
   Рез = СтрЗаменить(Рез,"д","d"); 
   Рез = СтрЗаменить(Рез,"е","e"); 
   Рез = СтрЗаменить(Рез,"ё","e"); 
   Рез = СтрЗаменить(Рез,"ж","zh"); 
   Рез = СтрЗаменить(Рез,"з","z"); 
   Рез = СтрЗаменить(Рез,"и","i"); 
   Рез = СтрЗаменить(Рез,"к","k"); 
   Рез = СтрЗаменить(Рез,"л","l"); 
   Рез = СтрЗаменить(Рез,"м","m"); 
   Рез = СтрЗаменить(Рез,"н","n"); 
   Рез = СтрЗаменить(Рез,"о","o"); 
   Рез = СтрЗаменить(Рез,"п","p"); 
   Рез = СтрЗаменить(Рез,"р","r"); 
   Рез = СтрЗаменить(Рез,"с","s"); 
   Рез = СтрЗаменить(Рез,"т","t"); 
   Рез = СтрЗаменить(Рез,"у","u"); 
   Рез = СтрЗаменить(Рез,"ф","f"); 
   Рез = СтрЗаменить(Рез,"х","h"); 
   Рез = СтрЗаменить(Рез,"ч","ch"); 
   Рез = СтрЗаменить(Рез,"ш","sh"); 
   Рез = СтрЗаменить(Рез,"щ","sch"); 
   Рез = СтрЗаменить(Рез,"ъ",""); 
   Рез = СтрЗаменить(Рез,"ь",""); 
   Рез = СтрЗаменить(Рез,"э","e"); 
   Рез = СтрЗаменить(Рез,"ю","yu"); 
   Рез = СтрЗаменить(Рез,"й","i"); 
   Рез = СтрЗаменить(Рез,"ц","c"); 
   Рез = СтрЗаменить(Рез,"я","ya"); 
   Рез = СтрЗаменить(Рез,"ы","i"); 
   Рез = СтрЗаменить(Рез,"А","A"); 
   Рез = СтрЗаменить(Рез,"Б","B"); 
   Рез = СтрЗаменить(Рез,"В","V"); 
   Рез = СтрЗаменить(Рез,"Г","G"); 
   Рез = СтрЗаменить(Рез,"Д","D"); 
   Рез = СтрЗаменить(Рез,"Е","E"); 
   Рез = СтрЗаменить(Рез,"Ё","E"); 
   Рез = СтрЗаменить(Рез,"Ж","ZH"); 
   Рез = СтрЗаменить(Рез,"З","Z"); 
   Рез = СтрЗаменить(Рез,"И","I"); 
   Рез = СтрЗаменить(Рез,"К","K"); 
   Рез = СтрЗаменить(Рез,"Л","L"); 
   Рез = СтрЗаменить(Рез,"М","M"); 
   Рез = СтрЗаменить(Рез,"Н","N"); 
   Рез = СтрЗаменить(Рез,"О","O"); 
   Рез = СтрЗаменить(Рез,"П","P"); 
   Рез = СтрЗаменить(Рез,"Р","R"); 
   Рез = СтрЗаменить(Рез,"С","S"); 
   Рез = СтрЗаменить(Рез,"Т","T"); 
   Рез = СтрЗаменить(Рез,"У","U"); 
   Рез = СтрЗаменить(Рез,"Ф","F"); 
   Рез = СтрЗаменить(Рез,"Х","H"); 
   Рез = СтрЗаменить(Рез,"Ч","CH"); 
   Рез = СтрЗаменить(Рез,"Ш","SH"); 
   Рез = СтрЗаменить(Рез,"Щ","SCH"); 
   Рез = СтрЗаменить(Рез,"Ъ",""); 
   Рез = СтрЗаменить(Рез,"Ь",""); 
   Рез = СтрЗаменить(Рез,"Ы","I"); 
   Рез = СтрЗаменить(Рез,"Ц","C"); 
   Рез = СтрЗаменить(Рез,"Э","E"); 
   Рез = СтрЗаменить(Рез,"Ю","YU"); 
   Рез = СтрЗаменить(Рез,"Я","YA"); 
   Рез = СтрЗаменить(Рез,"Й","I");
   
   //Рез = СтрЗаменить(Рез," ","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"--","-"); 
   Рез = СтрЗаменить(Рез,"#",""); 
   Рез = СтрЗаменить(Рез,"№",""); 
   //Рез = СтрЗаменить(Рез,",",""); 
   //Рез = СтрЗаменить(Рез,".",""); 
   //Рез = СтрЗаменить(Рез,"/",""); 
   Рез = СтрЗаменить(Рез,"""",""); 
   //Рез = СтрЗаменить(Рез,"(",""); 
   //Рез = СтрЗаменить(Рез,")",""); 
   
   Возврат(Рез);
  
КонецФункции